dietolive-tw/hitachi_ac_mitm/sdkconfig.defaults.wifi_backup
CONFIG_IDF_TARGET="esp32c6"

# Flash 16MB（ESP32-C6 實際晶片為 16MB）
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"

# 啟用 BOYA flash chip 專用 driver（消除 generic driver 警告）
CONFIG_SPI_FLASH_SUPPORT_BOYA_CHIP=y

# enable BT (Thread/Bluetooth commissioning)
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ENABLE_CONN_REATTEMPT=n

# enable lwip ipv6 autoconfig
CONFIG_LWIP_IPV6_AUTOCONFIG=y

# Use a custom partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0xC000

# Enable chip shell
CONFIG_ENABLE_CHIP_SHELL=y

# 6 個動態 endpoint: room_air_conditioner + temperature_sensor + 2x contact_sensor + 預留 2 個
CONFIG_ESP_MATTER_MAX_DYNAMIC_ENDPOINT_COUNT=6

# enable lwIP route hooks
CONFIG_LWIP_HOOK_IP6_ROUTE_DEFAULT=y
CONFIG_LWIP_HOOK_ND6_GET_GW_DEFAULT=y

# Button
CONFIG_BUTTON_PERIOD_TIME_MS=20
CONFIG_BUTTON_LONG_PRESS_TIME_MS=5000

# disable softap by default
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=n

# Enable OTA Requestor
CONFIG_ENABLE_OTA_REQUESTOR=y

CONFIG_ENABLE_WIFI_AP=n

# Enable HKDF in mbedtls
CONFIG_MBEDTLS_HKDF_C=y

# Increase LwIP IPv6 address number to 6 (MAX_FABRIC + 1)
CONFIG_LWIP_IPV6_NUM_ADDRESSES=6

# disable groupcast cluster until verified
CONFIG_SUPPORT_GROUPCAST_CLUSTER=n
